%% Middle AUV parameters
L = 213.799; % Длина ROV [mm]
H = 89.07; % Высота ROV [mm]
W = 193.866; % Ширина ROV [mm]
rho = 1000; % Плотность жидкости [kg/m^3]
PF = 10637.097; % Площадь фронтовой проекции [mm^2]
PS = 23902.237; % Площадь боковой проекции [mm^2]
PT = 13724.628; % Площадь верхней проекции [mm^2]
m = 1421.943 * 10^-3; % Масса ROV [kg]
r_g_b = [90.12 -0.023 3.17]';  % центр масс гравитационный 
r_b_b = [L/2 H/2 W/2]';  % центр масс геометрический
r_g_b = r_g_b / 10^3; % переводим [mm] в [m]
r_b_b = r_b_b / 10^3; % переводим [mm] в [m]
B = m * 9.81;

I0  = [ 2.551E+06 -612.421 -1.730E+05;
       -612.421 3.174E+06 320.636;
       -1.730E+05 320.636 5.029E+06]; % [g mm^2]

% I0  = diag(m*[(W^2+H^2) (L^2+H^2) (W^2+L^2)]/12).*10^-6;

I0 = I0 .* 0.01;